app/controllers/probs_controller.rb

  def index
    @probs = Prob.all
---
SELECT "probs".* FROM "probs"

  def show
    @prob = Prob.find(params[:id])
    @states = State.find_all_by_prob_id(params[:id])
---
SELECT "probs".* FROM "probs" WHERE "probs"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "states".* FROM "states" WHERE "states"."prob_id" = 5

  def edit
    @prob = Prob.find(params[:id])
---
SELECT "probs".* FROM "probs" WHERE "probs"."id" = ? LIMIT 1  [["id", "4"]]

  def create
    @prob = Prob.new(params[:prob])
    states = @prob.state.split("\n")
    a = 0
    states.each do |state|
      @state = @prob.states.build(
        prob_id: @prob.id,
        compo: state,
        ans: a
      )
      a = 1
    end


    respond_to do |format|
      if @prob.save
---
INSERT INTO "probs" ("auther", "created_at", "state", "title", "updated_at", "url") VALUES (?, ?, ?, ?, ?, ?)  [["auther", "s"], ["created_at", Thu, 07 Mar 2013 15:45:51 UTC +00:00], ["state", "a\r\nb\r\nc\r\nd\r\ne"], ["title", "a"], ["updated_at", Thu, 07 Mar 2013 15:45:51 UTC +00:00], ["url", "a"]]
INSERT INTO "states" ("ans", "compo", "created_at", "prob_id", "updated_at") VALUES (?, ?, ?, ?, ?)  [["ans", nil], ["compo", nil], ["created_at", Thu, 07 Mar 2013 15:45:51 UTC +00:00], ["prob_id", 1], ["updated_at", Thu, 07 Mar 2013 15:45:51 UTC +00:00]]

  def update
    @prob = Prob.find(params[:id])

    respond_to do |format|
      if @prob.update_attributes(params[:prob])
---
SELECT "probs".* FROM "probs" WHERE "probs"."id" = ? LIMIT 1  [["id", "4"]]
UPDATE "probs" SET "url" = 'rails.png', "auther" = 'a', "updated_at" = '2013-03-08 01:44:39.199963' WHERE "probs"."id" = 4

  def destroy
    @prob = Prob.find(params[:id])
    @prob.destroy
---
SELECT "probs".* FROM "probs" WHERE "probs"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "probs" WHERE "probs"."id" = ?  [["id", 1]]

  def exam
    #@probs = Prob.find_all_by_auther('a')
    @probs = []
    @p = params[:question]
    @p.each do |key, value|
      if value.to_i == 1
        @probs << Prob.find(key)
      end
    end
    @states = []
    @probs.each do |prob|
      @states << State.find_all_by_prob_id(prob.id)
---
SELECT "probs".* FROM "probs" WHERE "probs"."id" = ? LIMIT 1  [["id", 2]]
SELECT "states".* FROM "states" WHERE "states"."prob_id" = 2